puntobello-realtimenews-webapp/development/loadtesthighlongrun.yml
config:
  target: {{ PUNTOBELLO_TARGET_URL }}   # the url of your socket.io server in the format wss://your-url.com
  phases:
    - duration: 1200
      arrivalRate: 10
      rampTo: 20
      name: "Increasing load"
  engines:
    socketio-v3:
      pingInterval: 40000
      pingTimeout: 30000
      transports: ["websocket"]

scenarios:
  - name: Load test PuntoBello PubSub
    engine: "socketio-v3"
    flow:
      - connect:
          url: {{ PUNTOBELLO_TARGET_URL }} # the url of your socket.io server in the format wss://your-url.com
      - think: 600  # Wait for 10 minutes before disconnecting
      - disconnect