puntobello-realtimenews-webapp/development/loadteststandard.yml
config:
  target: {{ PUNTOBELLO_TARGET_URL }}   # the url of your socket.io server in the format wss://your-url.com
  phases:
    - duration: 20
      arrivalRate: 10
      name: "Constant load"
  engines:
   socketio-v3:
     pingInterval: 40000
     pingTimeout: 30000
     transports: ["websocket"]
scenarios:
  - name: Load test PuntoBello PubSub
    engine: "socketio-v3"
    flow:
      - think: 600 # do nothing for 10m and disconnect