puntobello-realtimenews-webapp/development/loadtestveryhighshorterrun.yml
config:
  target: "{{ $processEnvironment.PUNTOBELLO_TARGET_URL }}"  # the url of your socket.io server in the format wss://your-url.com
  phases:
    - duration: 300
      arrivalRate: 40
      rampTo: 80
      name: "Increasing load"
  engines:
    socketio-v3:
      pingInterval: 40000
      pingTimeout: 30000
      transports: ["websocket"]

scenarios:
  - name: Load test PuntoBello PubSub
    engine: "socketio-v3"
    flow:
      - connect:
          url: "{{ $processEnvironment.PUNTOBELLO_TARGET_URL }}" # the url of your socket.io server in the format wss://your-url.com
      - think: 600  # Wait for 10 minutes before disconnecting
      - disconnect